package loops.whileloop.practice;

import java.util.Scanner;

/*Производителите на вендинг машини искали
да направят машините си да връщат възможно най-малко монети ресто.
Напишете програма, която приема сума - рестото, което трябва да се върне
и изчислява с колко най-малко монети може да стане това. */
public class P05Coins {

    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);
        //1. прочитаме рестото, което трябва да върнем.
        //2.  да ни е по-лесно, превръщаме рестото в цяло число (левовете в стотинки)
        //3. while цикъл, в който ще кажем, че докато totalCoins > 0, ще тече действието
                //3.1.вътре ще направим проверка за totalCoins: ще проверим коя е възможно най-голямата монета (т.е. 2 лв = 200 ст.)

    double sum = Double.parseDouble(scanner.nextLine()); //1
    double totalSum = Math.floor(sum * 100); //2 (с Math.floor закръгляме надолу и се уверяваме, че някои стойности (напр 0.56) няма да завършат на 0000.1 (0.56000001) и няма да даде грешка при тях (това си е грешка на дабъла)
    int countCoins = 0; //4,1 трябва да знаем колко монети ще върнем

    while(totalSum > 0){ //3

        if (totalSum >= 200){ //4 (примерно имаме 2.50, които трябва да върнем. 2 лв. ни е най-голямата монета
            totalSum -= 200; //с всяка стъпка намаляваме сумата според конкретния if
            countCoins++; //увеличаваме бройката на стотинките
        } else if (totalSum >= 100) { //4.2 за 1 лев
            totalSum -= 100; //вадим от общата сума (123-100 -> 100 ресто -> 100. Остават 23 стотинки. While цикъла се завърта отново, защото сме изпълнили условието. сега проверяваме 23 стотинки
            countCoins++; // добавяме една монета (за 1 лев)
        }else if (totalSum >= 50) { //4.3 за 50 ст.
            totalSum -= 50;
            countCoins++;
        }else if (totalSum >= 20) { //4.4 за 20 ст.
            totalSum -= 20; //останали са ни 23 стотинки - 20 = 3. Вадим още 20 от totalSum и завъртаме while цикъла отначало за останалите 3 стотинки
            countCoins++;
        }else if (totalSum >= 10) { //4.5 за 10 ст.
            totalSum -= 10;
            countCoins++;
        } else if (totalSum >= 5) { //4.6 за 5 ст.
            totalSum -= 5;
            countCoins++;
        } else if (totalSum >= 2) { //4.73 за 2 ст.
            totalSum -= 2; //3-2=1 => завъртаме цикъла с 1 стотинка
            countCoins++;
        }else if (totalSum >= 1) { //4.3 за 1 ст.
            totalSum -= 1;
            countCoins++;
        }
    }

        System.out.println(countCoins);
  }
}
