package loops.forloop.lab;

import java.util.Scanner;

/*Да се напише програма, която чете n-на брой цели числа, въведени от потребителя и ги сумира.
•	От първия ред на входа се въвежда броят числа n.
•	От следващите n реда се въвежда по едно цяло число.
Програмата трябва да прочете числата, да ги сумира и да отпечата сумата им.
Примерен вход1: 2  10  20
Примерен изход1: 30
Примерен вход2: 4  45  -20  7  11
Примерен изход2: 43*/

public class P07SumNumbers {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        int n = Integer.parseInt(scanner.nextLine()); //1. задаваме колко числа ще приема програмата.
        
        int sum = 0; //4. въвеждаме променлива за for цикъла. Запиаваме я извън цикъкла, за да можем да я принтираме. ако е във фор цикъла, тя ще бъде изтрита, когати излезем от него
        // 2. с фор започвам да извършвам едно и също действие: четене на цяло число и добавянето кум сума:
        for (int i = 1; i <= n ; i++) { //Note: от 1 до n вкл. (ако i < n няма да отчете пследното число )
            int currentNum = Integer.parseInt(scanner.nextLine()); //3. Въвеждаме толкова числа, колкото ни иска програмата
                                                                    // тази променлива важи само за for цикъла
            sum = sum + currentNum; //5. сумата = въведените числа според зададените във фор цикъла.
        }

        //Внимаваме къде принтираме, да не е във фор цикъла
        System.out.println(sum); //6. сумираме числата, които сме въвели
    }
}
