package loops.nestedloops.exercises;

import java.util.Scanner;

/*Да се напише програма, която прочита едно цяло число N и генерира всички възможни "щастливи"
и различни 4-цифрени числа(всяка цифра от числото е в интервала [1...9]).
Числото трябва да отговаря на следните условия:
Щастливо число е 4-цифрено число, на което сбора от първите две цифри е равен на сбора от последните две.
Числото N трябва да се дели без остатък от сбора на първите две цифри на "щастливото" число.
Вход
Входът се чете от конзолата и се състои от едно цяло число в интервала [2...10000]
Изход
На конзолата трябва да се отпечатат всички "щастливи" и различни 4-цифрени числа, разделени с интервал.
Примерен вход1: 3
Примерен изход1: 1212 1221 2112 2121
Примерен вход2: 7
Примерен изход2:
1616 1625 1634 1643 1652 1661 2516 2525 2534 2543 2552 2561 3416 3425 3434 3443 3452 3461
4316 4325 4334 4343 4352 4361 5216 5225 5234 5243 5252 5261 6116 6125 6134 6143 6152 6161*/

public class P03LuckyNumbers {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        int num = Integer.parseInt(scanner.nextLine());

        String luckyNumbers = "";
        for (int i = 1; i <= 9; i++) {
            for (int j = 1; j <= 9; j++) {
                for (int k = 1; k <= 9; k++) {
                    for (int l = 1; l <= 9; l++) {
                        if ((i + j == k + l) && (num % (i + j) == 0)){
                                luckyNumbers += "" + i + j + k + l + " ";
                        }
                    }
                }
            }
        }

        System.out.println(luckyNumbers);
    }
}
