package loops.nestedloops.exercises;

import java.util.Scanner;

/*Поздравления, поради вашите задълбочени знания в сферата на програмирането
МВР реши да наеме точно вас за създаването на новата им система за генериране на специални автомобилни номера.
Всеки един специален автомобилен номер се състои от четири числа.
Условията, които разграничават специалните от обикновените номера са следните:
•	Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна,  завършва на четна
•	Първата цифра от номера е по-голяма от последната
•	Сумата от втората и третата цифра трябва да е четно число
Входът се състои от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
Вход
1.	Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
2.	Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
Изход
На конзолата трябва да се отпечатат всички специални номера, разделени с интервал.
Примерен вход1: 2 3
Примерен изход1: 3222 3332
Примерен вход2: 3 5
Примерен изход2: 4333 4353 4443 4533 4553 5334 5354 5444 5534 5554*/

public class P04CarNumber {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        int start = Integer.parseInt(scanner.nextLine());
        int end = Integer.parseInt(scanner.nextLine());

        String special = "";
        for (int i = start; i <= end ; i++) {
            for (int j = start; j <= end ; j++) {
                for (int k = start; k <= end ; k++) {
                    for (int l = start; l <= end ; l++) {
                        if((i % 2 == 0 && l % 2 != 0) || (i % 2 != 0 && l % 2 == 0)){
                            if(i > l){
                                if((j + k) % 2 == 0 )
                                special += "" + i + j + k + l + " ";
                            }
                        }
                    }
                }
            }
        }

        System.out.println(special);
    }
}
